GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/camera.c
static bool Cam_Check_Para(Style_Cam_Requset_Para *para)
{
 if((para->Channel_ID<=15)||(para->Channel_ID==0xFFFF))
 	{
 	if(para->PhotoNum < para->PhotoTotal)
		return  true;
 	}
 return false;
}


/*********************************************************************************
*函数名称:bool Camera_RX_Data(u16 *RxLen)
*功能描述:拍照接收数据处理
*输	入:RxLen:表示接收到得数据长度指针
*输	出:RxLen:表示接收到得数据长度指针 
*返 回 值:0表示接收进行中,1表示接收成功
*作	者:白养民
*创建日期:2013-06-3
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
static u8 Camera_RX_Data(u16 *RxLen)
{
	u8 ch;
	static u16 page_size=0;
	static u16 cam_rx_head_wr=0;
	
	/*串口是否收到数据*/
	while( RS485_read_char(&ch) )
	{
		switch(Current_Cam_Para.Rx_State)
		{
			case RX_DATA: /*保存信息格式: 位置(2B) 大小(2B) FLAG_FF 数据 0D 0A*/
				uart2_rx[uart2_rx_wr++] = ch;
				uart2_rx_wr 			%= UART2_RX_SIZE;
				if(uart2_rx_wr==page_size) Current_Cam_Para.Rx_State=RX_FCS;
				break;	
			case RX_IDLE:
				if(ch==0x40) Current_Cam_Para.Rx_State=RX_SYNC1;
				break;
			case RX_SYNC1:
				if(ch==0x40) Current_Cam_Para.Rx_State=RX_SYNC2;
				else Current_Cam_Para.Rx_State=RX_IDLE;
				break;
			case RX_SYNC2:
				if(ch==0x63)
				{
					cam_rx_head_wr=0;
					Current_Cam_Para.Rx_State=RX_HEAD;
				}	
				else 
					Current_Cam_Para.Rx_State=RX_IDLE;
				break;
			case RX_HEAD:
				uart2_rx[cam_rx_head_wr++]=ch;
				if(cam_rx_head_wr==5)
				{
					uart2_rx_wr=0;
					page_size=(uart2_rx[3]<<8)|uart2_rx[2];
					Current_Cam_Para.Rx_State=RX_DATA;
				}
				break;
			case RX_FCS:
				Current_Cam_Para.Rx_State=RX_0D;
				break;		
			case RX_0D:
				if(ch==0x0d) Current_Cam_Para.Rx_State=RX_0A;
				else Current_Cam_Para.Rx_State=RX_IDLE;
				break;	
			case RX_0A:
				Current_Cam_Para.Rx_State=RX_IDLE;
				if(ch==0x0a) return 1;
				break;	
		}
	}
	return 0;
}



/*********************************************************************************
*函数名称:void Cam_response_ok( struct _Style_Cam_Requset_Para *para,uint32_t pic_id )
*功能描述:平台下发拍照命令处理函数的回调函数_单张照片拍照OK
*输	入:	para	:拍照处理结构体
		pic_id	:图片ID
*输	出:	none
*返 回 值:rt_err_t
*作	者:白养民
*创建日期:2013-06-17
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
void Cam_response_ok( struct _Style_Cam_Requset_Para *para,uint32_t pic_id )
{
 if( para->SendPhoto )
 	{
 	Cam_jt808_0x800( pic_id, !para->SavePhoto );
 	}
}



/*********************************************************************************
*函数名称:void Cam_response_end( struct _Style_Cam_Requset_Para *para )
*功能描述:平台下发拍照命令处理函数的回调函数
*输	入:	para	:拍照处理结构体
*输	出:	none
*返 回 值:rt_err_t
*作	者:白养民
*创建日期:2013-06-17
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
void Cam_response_end( struct _Style_Cam_Requset_Para *para )
{
	return;
}


/*********************************************************************************
*函数名称:void Camera_Process(void)
*功能描述:进行照相相关处理(包括有:拍照，存储照片，发送拍照结束指令给808)
*输	入:none
*输	出:none 
*返 回 值:none
*作	者:白养民
*创建日期:2013-06-3
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
u8 Camera_Process(void)
{
 u16 RxLen;
 static u16 cam_photo_size;
 static u8 cam_page_num=0;
 u8 cam_last_page=0;
 static uint32_t tick;
 static TypeDF_PackageHead pack_head;
 
 switch(Current_Cam_Para.State)
	{
	case CAM_NONE:
		{
			if(RT_EOK == rt_mq_recv(&mq_Cam,(void *)&Current_Cam_Para.Para,sizeof(Style_Cam_Requset_Para),RT_WAITING_NO))
				{
				Current_Cam_Para.State=CAM_IDLE;
				Current_Cam_Para.Para.start_tick=rt_tick_get();
				rt_kprintf("\r\n收到拍照消息");
				}
			else
				{
				return 0;
				}
		}
	case CAM_IDLE:
		{
			if((rt_tick_get() - Current_Cam_Para.Para.start_tick) >= (Current_Cam_Para.Para.PhoteSpace * (u32)Current_Cam_Para.Para.PhotoNum))
				{
				Current_Cam_Para.Retry=0;
				Current_Cam_Para.State=CAM_START;
				}
			break;
		}
	case CAM_START:
		{
			if(Current_Cam_Para.Retry>=3)
				{
				Current_Cam_Para.State=CAM_FALSE;
				break;
				}
			Current_Cam_Para.Retry++;
			memset(&pack_head,0,sizeof(pack_head));
			cam_page_num=0;
			cam_photo_size=0;
			tick=rt_tick_get();
			Cam_Start_Cmd(Current_Cam_Para.Para.Channel_ID);
			Current_Cam_Para.State=CAM_RX_PHOTO;
			Current_Cam_Para.Rx_State=RX_IDLE;
			break;
		}
	case CAM_GET_PHOTO:
		{
			tick=rt_tick_get();
			Cam_Read_Cmd(Current_Cam_Para.Para.Channel_ID);
			Current_Cam_Para.State=CAM_RX_PHOTO;
			Current_Cam_Para.Rx_State=RX_IDLE;
			break;
		}
	case CAM_RX_PHOTO:
		{
			if(1==Camera_RX_Data(&RxLen))
			{
				rt_kprintf("\r\n接收到拍照数据!");
				tick=rt_tick_get();
				///收到数据,存储,判断是否图片结束
				if(uart2_rx_wr>512)		///数据大于512,非法
				{
					rt_kprintf("\r\nCAM%d invalided\r\n",Current_Cam_Para.Para.Channel_ID);
					Current_Cam_Para.State=CAM_START;
					break;
				}
				if(uart2_rx_wr==512)
				{
					if((uart2_rx[510]==0xff)&&(uart2_rx[511]==0xD9))
					{
						cam_last_page=1;
					}
				}
				else
				{
					cam_last_page=1;
				}
				
				cam_page_num++;
				cam_photo_size+=uart2_rx_wr;
				///第一包数据，需要填写参数，然后存储才正确
				if(cam_page_num==1)
				{
					pack_head.Channel_ID=Current_Cam_Para.Para.Channel_ID;
					pack_head.TiggerStyle=Current_Cam_Para.Para.TiggerStyle;
					pack_head.Media_Format=0;
					pack_head.Media_Style=0;
					memcpy(&pack_head.Time,gps_datetime,6);
					/*
					pack_head.Time.years=0x13;
					pack_head.Time.months=0x06;
					pack_head.Time.days=tick>>24;
					pack_head.Time.hours=tick>>16;
					pack_head.Time.minutes=tick>>8;
					pack_head.Time.seconds=tick;
					*/
					memcpy(&pack_head.position,&gps_baseinfo,28);
					pack_head.State=0xFF;
					if(Current_Cam_Para.Para.SavePhoto == 0)
						{
						pack_head.State &= ~(BIT(2));
						}
				}
				///最后一包数据，需要将长度写入。
				if(cam_last_page)
				{
					pack_head.Len=cam_photo_size+64;
					Current_Cam_Para.State=CAM_OK;
				}
				else
				{
					Current_Cam_Para.State=CAM_GET_PHOTO;
				}
				///保存数据
				Cam_Flash_WrPic(uart2_rx,uart2_rx_wr,&pack_head);
				Hex_To_Ascii(uart2_rx,CamTestBuf,uart2_rx_wr);
				rt_kprintf("\r\n拍照数据:\r\n");
				rt_kprintf("%s\r\n",CamTestBuf);
				rt_kprintf("\r\n%d>CAM%d photo %d bytes",rt_tick_get()*10,Current_Cam_Para.Para.Channel_ID,cam_photo_size);
				uart2_rx_wr=0;
			}
			else if(rt_tick_get()-tick>RT_TICK_PER_SECOND*2)	///判读是否超时
			{
				Current_Cam_Para.State=CAM_START;
			}
			break;
		}
	case CAM_OK:
		{
			++Current_Cam_Para.Para.PhotoNum;
			if(Current_Cam_Para.Para.cb_response_cam_ok != RT_NULL)		///调用单张照片拍照成功回调函数
				{
				Current_Cam_Para.Para.cb_response_cam_ok(&Current_Cam_Para.Para,pack_head.Data_ID);
				}
			else		///默认的回调函数
				{
				Cam_response_ok(&Current_Cam_Para.Para,pack_head.Data_ID);
				}
			
			rt_kprintf("\r\n拍照成功!");
			getpicpara();
			if(Current_Cam_Para.Para.PhotoNum >= Current_Cam_Para.Para.PhotoTotal)
				{
				Current_Cam_Para.State = CAM_END;		///拍照任务完成
				}
			else
				{
				Current_Cam_Para.State=CAM_IDLE;		///单张照片拍照完成
				}
			break;
		}
	case CAM_FALSE:
		{
			rt_kprintf("\r\n拍照失败!");
			Current_Cam_Para.State=CAM_END;
		}
	case CAM_END:
		{
			rt_kprintf("\r\n拍照结束!");
			Current_Cam_Para.State=CAM_NONE;
			if(Current_Cam_Para.Para.cb_response_cam_end!= RT_NULL)		///调用单张照片拍照成功回调函数
				{
				Current_Cam_Para.Para.cb_response_cam_end(&Current_Cam_Para.Para);
				rt_free(Current_Cam_Para.Para.user_para);
				rt_kprintf("\r\nCam_jt808_0x8801_cam_end_free");
				}
			else		///默认的回调函数
				{
				Cam_response_end(&Current_Cam_Para.Para);
				}
			break;
		}
	default :
		{
			Current_Cam_Para.State=CAM_NONE;
		}
	}
 return 1;
}





/*********************************************************************************
*函数名称:void Cam_takepic_ex(u16 id,u16 num,u16 space,u8 send,Style_Cam_Requset_Para trige)
*功能描述:	拍照请求函数，
*输	入:	id		:照相机ID范围为1-15
		num		:拍照数量
		space	:拍照间隔，单位为秒
		save	:是否保存图片到FLASH中
		send	:拍完后是否上传，1表示上传
		trige	:拍照触发源类型为	Style_Cam_Requset_Para
*输	出:	none
*返 回 值:none
*作	者:白养民
*创建日期:2013-06-21
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
void Cam_takepic_ex(u16 id,u16 num,u16 space,u8 save,u8 send,Cam_Trigger trige)
{
 Style_Cam_Requset_Para tempPara;
 if(trige>Cam_TRIGGER_OTHER)
 	trige = Cam_TRIGGER_OTHER;
 memset(&tempPara,0,sizeof(tempPara));
 tempPara.Channel_ID=id;
 tempPara.PhoteSpace=space * RT_TICK_PER_SECOND;
 tempPara.PhotoTotal=num;
 tempPara.SavePhoto	= save;
 tempPara.SendPhoto	= send;
 tempPara.TiggerStyle=trige;
 take_pic_request(&tempPara);
 rt_kprintf("\r\n请求拍照ID=%d",id);
}
FINSH_FUNCTION_EXPORT( Cam_takepic_ex, para_id_num_space_save_send_trige);


/*********************************************************************************
*函数名称:void Cam_takepic(u16 id,u8 send,Style_Cam_Requset_Para trige)
*功能描述:	拍照请求函数，
*输	入:	id		:照相机ID范围为1-15
		save	:是否保存图片到FLASH中
		send	:拍完后是否上传，1表示上传
		trige	:拍照触发源类型为	Style_Cam_Requset_Para
*输	出:	none
*返 回 值:none
*作	者:白养民
*创建日期:2013-06-21
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
void Cam_takepic(u16 id,u8 save,u8 send,Cam_Trigger trige)
{
 Cam_takepic_ex(id,1,0,save,send,trige);
}
FINSH_FUNCTION_EXPORT( Cam_takepic,  para_id_save_send_trige);

/************************************** The End Of File **************************************/
